In [1]:
import numpy as np
import pandas as pd

In [3]:
dfsocial=pd.read_csv(r'C:\Users\User\Downloads\ML Dataset\Decision Tree\Social_Network_Ads.csv')

In [4]:
dfsocial

      User ID  Gender  Age  EstimatedSalary  Purchased
0    15624510    Male   19            19000          0
1    15810944    Male   35            20000          0
2    15668575  Female   26            43000          0
3    15603246  Female   27            57000          0
4    15804002    Male   19            76000          0
..        ...     ...  ...              ...        ...
395  15691863  Female   46            41000          1
396  15706071    Male   51            23000          1
397  15654296  Female   50            20000          1
398  15755018    Male   36            33000          0
399  15594041  Female   49            36000          1

[400 rows x 5 columns]

In [9]:
dfsocial['Age'].describe()

count    400.000000
mean      37.655000
std       10.482877
min       18.000000
25%       29.750000
50%       37.000000
75%       46.000000
max       60.000000
Name: Age, dtype: float64

In [10]:
dfsocial.drop('User ID',axis=1,inplace=True)

In [11]:
dfsocial

     Gender  Age  EstimatedSalary  Purchased
0      Male   19            19000          0
1      Male   35            20000          0
2    Female   26            43000          0
3    Female   27            57000          0
4      Male   19            76000          0
..      ...  ...              ...        ...
395  Female   46            41000          1
396    Male   51            23000          1
397  Female   50            20000          1
398    Male   36            33000          0
399  Female   49            36000          1

[400 rows x 4 columns]

In [12]:
dfmale=pd.get_dummies(dfsocial['Gender'],drop_first=True)

In [13]:
dfmale

     Male
0       1
1       1
2       0
3       0
4       1
..    ...
395     0
396     1
397     0
398     1
399     0

[400 rows x 1 columns]

In [14]:
dfsocial=pd.concat([dfsocial,dfmale],axis=1)

In [15]:
dfsocial

     Gender  Age  EstimatedSalary  Purchased  Male
0      Male   19            19000          0     1
1      Male   35            20000          0     1
2    Female   26            43000          0     0
3    Female   27            57000          0     0
4      Male   19            76000          0     1
..      ...  ...              ...        ...   ...
395  Female   46            41000          1     0
396    Male   51            23000          1     1
397  Female   50            20000          1     0
398    Male   36            33000          0     1
399  Female   49            36000          1     0

[400 rows x 5 columns]

In [16]:
dfsocial=dfsocial.drop('Gender',axis=1)

In [17]:
dfsocial

     Age  EstimatedSalary  Purchased  Male
0     19            19000          0     1
1     35            20000          0     1
2     26            43000          0     0
3     27            57000          0     0
4     19            76000          0     1
..   ...              ...        ...   ...
395   46            41000          1     0
396   51            23000          1     1
397   50            20000          1     0
398   36            33000          0     1
399   49            36000          1     0

[400 rows x 4 columns]

In [18]:
dfsocial=dfsocial[['Male','Age','EstimatedSalary','Purchased']]

In [19]:
dfsocial

     Male  Age  EstimatedSalary  Purchased
0       1   19            19000          0
1       1   35            20000          0
2       0   26            43000          0
3       0   27            57000          0
4       1   19            76000          0
..    ...  ...              ...        ...
395     0   46            41000          1
396     1   51            23000          1
397     0   50            20000          1
398     1   36            33000          0
399     0   49            36000          1

[400 rows x 4 columns]

In [20]:
X=dfsocial.drop('Purchased',axis=1)

In [21]:
X

     Male  Age  EstimatedSalary
0       1   19            19000
1       1   35            20000
2       0   26            43000
3       0   27            57000
4       1   19            76000
..    ...  ...              ...
395     0   46            41000
396     1   51            23000
397     0   50            20000
398     1   36            33000
399     0   49            36000

[400 rows x 3 columns]

In [22]:
y=dfsocial['Purchased']

In [23]:
y

0      0
1      0
2      0
3      0
4      0
      ..
395    1
396    1
397    1
398    0
399    1
Name: Purchased, Length: 400, dtype: int64

In [24]:
from sklearn.model_selection import train_test_split

In [25]:
Xtrain,Xtest,ytrain,ytest=train_test_split(X,y,test_size=0.20,random_state=42)

In [28]:
Xtrain.shape,Xtest.shape,X.shape

((320, 3), (80, 3), (400, 3))

In [29]:
ytrain.shape,ytest.shape,y.shape

((320,), (80,), (400,))

In [30]:
from sklearn.tree import DecisionTreeClassifier

In [31]:
dtree=DecisionTreeClassifier() # bydefault criterion='gini'

In [32]:
dtree

DecisionTreeClassifier()

In [33]:
dtree.fit(Xtrain,ytrain)

DecisionTreeClassifier()

In [34]:
dtree.score(Xtest,ytest)

0.85

## Entropy Model Building

In [35]:
from sklearn.tree import DecisionTreeClassifier

In [36]:
DTentro=DecisionTreeClassifier(criterion='entropy')

In [38]:
DTentro

DecisionTreeClassifier(criterion='entropy')

In [41]:
DTentro.fit(Xtrain,ytrain)

DecisionTreeClassifier(criterion='entropy')

In [42]:
DTentro.score(Xtest,ytest)

0.85